---
title: MEPFabricationFailures
classe: Autodesk.Revit.DB.BuiltInFailures+MEPFabricationFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 58
---

# MEPFabricationFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AdditionalPartNotLoaded { get; }` | `MEPFabricationFailures.AdditionalPartNotLoaded` | FailureDefinitionId |
| `FailureDefinitionId CannotConvertFlexPipeToPart { get; }` | `MEPFabricationFailures.CannotConvertFlexPipeToPart` | FailureDefinitionId |
| `FailureDefinitionId CannotMatchFabricationHangerSizeToHost { get; }` | `MEPFabricationFailures.CannotMatchFabricationHangerSizeToHost` | FailureDefinitionId |
| `FailureDefinitionId FabDbChangeConn { get; }` | `MEPFabricationFailures.FabDbChangeConn` | FailureDefinitionId |
| `FailureDefinitionId FabDbOpenJobConn { get; }` | `MEPFabricationFailures.FabDbOpenJobConn` | FailureDefinitionId |
| `FailureDefinitionId FabDbSwapOut { get; }` | `MEPFabricationFailures.FabDbSwapOut` | FailureDefinitionId |
| `FailureDefinitionId FabricationConfigurationCorrupted { get; }` | `MEPFabricationFailures.FabricationConfigurationCorrupted` | FailureDefinitionId |
| `FailureDefinitionId FabricationHangerCannotBeSloped { get; }` | `MEPFabricationFailures.FabricationHangerCannotBeSloped` | FailureDefinitionId |
| `FailureDefinitionId FabricationHangerHostNotFound { get; }` | `MEPFabricationFailures.FabricationHangerHostNotFound` | FailureDefinitionId |
| `FailureDefinitionId FabricationHangerNotConnectToHost { get; }` | `MEPFabricationFailures.FabricationHangerNotConnectToHost` | FailureDefinitionId |
| `FailureDefinitionId FabricationHangerOutOfHost { get; }` | `MEPFabricationFailures.FabricationHangerOutOfHost` | FailureDefinitionId |
| `FailureDefinitionId FabricationHangerSizeNotMatch { get; }` | `MEPFabricationFailures.FabricationHangerSizeNotMatch` | FailureDefinitionId |
| `FailureDefinitionId FabricationOutOfSizeCondition { get; }` | `MEPFabricationFailures.FabricationOutOfSizeCondition` | FailureDefinitionId |
| `FailureDefinitionId FabricationOverSizedCheck { get; }` | `MEPFabricationFailures.FabricationOverSizedCheck` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartBadConnectionAlignmentWarning { get; }` | `MEPFabricationFailures.FabricationPartBadConnectionAlignmentWarning` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartBadConnectionConnectivityWarning { get; }` | `MEPFabricationFailures.FabricationPartBadConnectionConnectivityWarning` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartBadConnectionSizeWarning { get; }` | `MEPFabricationFailures.FabricationPartBadConnectionSizeWarning` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartCannotBeMirrored { get; }` | `MEPFabricationFailures.FabricationPartCannotBeMirrored` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartCannotChangeServiceSizeWarning { get; }` | `MEPFabricationFailures.FabricationPartCannotChangeServiceSizeWarning` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartCannotChangeSlopeError { get; }` | `MEPFabricationFailures.FabricationPartCannotChangeSlopeError` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartCannotChangeTypeBadDimError { get; }` | `MEPFabricationFailures.FabricationPartCannotChangeTypeBadDimError` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartCannotChangeTypeBadDimUnConnError { get; }` | `MEPFabricationFailures.FabricationPartCannotChangeTypeBadDimUnConnError` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartCannotChangeTypeError { get; }` | `MEPFabricationFailures.FabricationPartCannotChangeTypeError` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartCannotChangeTypeIncompatError { get; }` | `MEPFabricationFailures.FabricationPartCannotChangeTypeIncompatError` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartCannotChangeTypeIncompatUnConnError { get; }` | `MEPFabricationFailures.FabricationPartCannotChangeTypeIncompatUnConnError` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartCannotChangeTypeMisalignedError { get; }` | `MEPFabricationFailures.FabricationPartCannotChangeTypeMisalignedError` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartCannotChangeTypeMisalignedUnConnError { get; }` | `MEPFabricationFailures.FabricationPartCannotChangeTypeMisalignedUnConnError` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartCannotChangeTypeUnConnError { get; }` | `MEPFabricationFailures.FabricationPartCannotChangeTypeUnConnError` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartCannotChangeTypeWarning { get; }` | `MEPFabricationFailures.FabricationPartCannotChangeTypeWarning` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartExceededAngleFlexToleranceWarning { get; }` | `MEPFabricationFailures.FabricationPartExceededAngleFlexToleranceWarning` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartExcludedPartWarning { get; }` | `MEPFabricationFailures.FabricationPartExcludedPartWarning` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartFitFailure { get; }` | `MEPFabricationFailures.FabricationPartFitFailure` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartFitFailWarning { get; }` | `MEPFabricationFailures.FabricationPartFitFailWarning` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartHasInvalidGeometry { get; }` | `MEPFabricationFailures.FabricationPartHasInvalidGeometry` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartInvalidConnection { get; }` | `MEPFabricationFailures.FabricationPartInvalidConnection` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartInvalidSpecification { get; }` | `MEPFabricationFailures.FabricationPartInvalidSpecification` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartNoPartTypeFound { get; }` | `MEPFabricationFailures.FabricationPartNoPartTypeFound` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartNotAttachedToStraight { get; }` | `MEPFabricationFailures.FabricationPartNotAttachedToStraight` | FailureDefinitionId |
| `FailureDefinitionId FabricationPartOptimizeInvalidConnection { get; }` | `MEPFabricationFailures.FabricationPartOptimizeInvalidConnection` | FailureDefinitionId |
| `FailureDefinitionId FabricationRodDetachFromHangerError { get; }` | `MEPFabricationFailures.FabricationRodDetachFromHangerError` | FailureDefinitionId |
| `FailureDefinitionId FabricationRodsConnectionChangedWarning { get; }` | `MEPFabricationFailures.FabricationRodsConnectionChangedWarning` | FailureDefinitionId |
| `FailureDefinitionId FabricationRodsDisconnectedError { get; }` | `MEPFabricationFailures.FabricationRodsDisconnectedError` | FailureDefinitionId |
| `FailureDefinitionId FabricationRodsDisconnectedWarning { get; }` | `MEPFabricationFailures.FabricationRodsDisconnectedWarning` | FailureDefinitionId |
| `FailureDefinitionId FabricationServiceMismatch { get; }` | `MEPFabricationFailures.FabricationServiceMismatch` | FailureDefinitionId |
| `FailureDefinitionId FabricationStraigtLengthOversized { get; }` | `MEPFabricationFailures.FabricationStraigtLengthOversized` | FailureDefinitionId |
| `FailureDefinitionId FixedFabricationPartNotChangeLength { get; }` | `MEPFabricationFailures.FixedFabricationPartNotChangeLength` | FailureDefinitionId |
| `FailureDefinitionId GroupedFabricationPartNotReposition { get; }` | `MEPFabricationFailures.GroupedFabricationPartNotReposition` | FailureDefinitionId |
| `FailureDefinitionId HangerProfileNotMatchWithHost { get; }` | `MEPFabricationFailures.HangerProfileNotMatchWithHost` | FailureDefinitionId |
| `FailureDefinitionId HangerWidthOutOfRange { get; }` | `MEPFabricationFailures.HangerWidthOutOfRange` | FailureDefinitionId |
| `FailureDefinitionId InvalidConnectionsHaveBeenDisconnected { get; }` | `MEPFabricationFailures.InvalidConnectionsHaveBeenDisconnected` | FailureDefinitionId |
| `FailureDefinitionId InvalidSelectionThereCannotBeOpenConnectors { get; }` | `MEPFabricationFailures.InvalidSelectionThereCannotBeOpenConnectors` | FailureDefinitionId |
| `FailureDefinitionId NoStructuralHostToAttachWarning { get; }` | `MEPFabricationFailures.NoStructuralHostToAttachWarning` | FailureDefinitionId |
| `FailureDefinitionId NotAllPartsWereConvertedUnsuportedFittingOffsets { get; }` | `MEPFabricationFailures.NotAllPartsWereConvertedUnsuportedFittingOffsets` | FailureDefinitionId |
| `FailureDefinitionId PinnedFabricationPartNotChangeExtension { get; }` | `MEPFabricationFailures.PinnedFabricationPartNotChangeExtension` | FailureDefinitionId |
| `FailureDefinitionId PinnedFabricationPartNotReposition { get; }` | `MEPFabricationFailures.PinnedFabricationPartNotReposition` | FailureDefinitionId |
| `FailureDefinitionId PlaceCutinFittingFailed { get; }` | `MEPFabricationFailures.PlaceCutinFittingFailed` | FailureDefinitionId |
| `FailureDefinitionId SizeNotAvailableInFabricationService { get; }` | `MEPFabricationFailures.SizeNotAvailableInFabricationService` | FailureDefinitionId |
| `FailureDefinitionId UneditableFabricationPartNotReposition { get; }` | `MEPFabricationFailures.UneditableFabricationPartNotReposition` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```